# string functions

If you have been using the pandas library in python you may have noticed that a lot of data comes in textual form instead of pure numbers as some people may imagine. 


This means there is a need to clean and preprocess string so it can be analyzed, consumed by algorithms, or shown to the public. Luckily pandas library has its own part that deals with string processing. 


In this article, we will walk you through this part of the pandas' library and show you the most useful pandas string processing functions. You will learn how to use

### isnumeric():

pandas.Series.str.isnumeric to Check whether all characters in each string are numeric.

In [1]:
import pandas as pd
s3 = pd.Series(['23', '4', 'â…•', ''])
s3.str.isnumeric()

0     True
1     True
2     True
3    False
dtype: bool

In [22]:
import pandas as pd
s1=pd.Series(['1','3','t','happy'])
s1.str.isnumeric()

0     True
1     True
2    False
3    False
dtype: bool

### isdigit()

isdigit() Function in pandas is used how to check for the presence of numeric digit in a column of dataframe in python.

In [25]:
s1.str.isdigit()

0     True
1     True
2    False
3    False
dtype: bool

### len():

With the help of len() we can compute the length of each string in DataFrame & if there is empty data in DataFrame, it returns NaN.

In [26]:
s1.str.len()

0    1
1    1
2    1
3    5
dtype: int64

### upper():

Converts all lowercase characters in strings in the DataFrame to upper case and returns the uppercase strings in result.

In [27]:
s1.str.upper()

0        1
1        3
2        T
3    HAPPY
dtype: object

### lower():

Converts all uppercase characters in strings in the DataFrame to lower case and returns the lowercase strings in the result.

In [8]:
s1.str.lower()

0        1
1        3
2        t
3    happy
dtype: object

### strip():

If there are spaces at the beginning or end of a string, we should trim the strings to eliminate spaces using strip() or remove the extra spaces contained by a string in DataFrame.

In [9]:
s1.str.strip()

0        1
1        3
2        t
3    happy
dtype: object

### islower():

 It checks whether all characters in each string in the Index of the Data-Frame in lower case or not, and returns a Boolean value.

In [5]:
import pandas as pd
s1=pd.Series(['1','3','t','happy'])
s1.str.islower()

0    False
1    False
2     True
3     True
dtype: bool

### isupper():

It checks whether all characters in each string in the Index of the Data-Frame in upper case or not, and returns a Boolean value.

In [73]:
s1.str.isupper()

0    False
1    False
2    False
3    False
dtype: bool

### Capitalize()

Capitalize() Function in python is used to capitalize the First character of the string or first character of the column in dataframe.

In [32]:
s1.str.capitalize()

0        1
1        3
2        T
3    Happy
dtype: object

### swapcase():

It swaps the case lower to upper and vice-versa. Like in the example below, it converts all uppercase characters in each string into lowercase and vice-versa (lowercase -> uppercase).

In [33]:
s1.str.swapcase()

0        1
1        3
2        T
3    HAPPY
dtype: object

### title():

title() function is used to convert strings in the Series/Index to titlecase. The function is equivalent to str. title()

In [34]:
s1.str.title()

0        1
1        3
2        T
3    Happy
dtype: object

### split(â€˜ â€˜):

Splits each string with the given pattern. Strings are split and the new elements after the performed split operation, are stored in a list.
***** split(pattern)

In [35]:
s1.str.split()

0        [1]
1        [3]
2        [t]
3    [happy]
dtype: object

### cat(sep=â€™ â€˜):

It concatenates the data-frame index elements or each string in DataFrame with given separator.

In [36]:
s1.str.cat()

'13thappy'

In [10]:
s1.str.cat(s1)

0            11
1            33
2            tt
3    happyhappy
dtype: object

In [11]:
s1.str.cat(sep=':')

'1:3:t:happy'

In [12]:
s1.str.cat(['@','#','%','&'])

0        1@
1        3#
2        t%
3    happy&
dtype: object

### join():

join() method is used to join all elements in list present in a series with passed delimiter

In [6]:
s1.str.join('#')

0            1
1            3
2            t
3    h#a#p#p#y
dtype: object

In [39]:
s1.str.join(';')

0            1
1            3
2            t
3    h;a;p;p;y
dtype: object

### replace(a,b):

 It replaces the value a with the value b like below in example â€˜Geeksâ€™ is being replaced by â€˜Gulshanâ€™.

In [47]:
s1.str.replace('h','%')

0        1
1        3
2        t
3    %appy
dtype: object

### contains(''):

str. contains() function is used to test if pattern or regex is contained within a string of a Series or Index

In [53]:
s1.str.contains('a')

0    False
1    False
2    False
3     True
dtype: bool

In [18]:
s1.str.contains('h')

0    False
1    False
2    False
3     True
dtype: bool

### isalnum():

isalnum() function is used to check whether all characters in each string are alphanumeric or not

In [57]:
s1.str.isalnum()

0    True
1    True
2    True
3    True
dtype: bool

### count(pattern):

 It returns the count of the appearance of pattern in each element in Data-Frame like below in example it counts â€˜nâ€™ in each string of DataFrame and returns the total counts of â€˜nâ€™ in each string

In [60]:
s1.str.count('a')

0    0
1    0
2    0
3    1
dtype: int64

In [19]:
s1.str.count('h')

0    0
1    0
2    0
3    1
dtype: int64

In [20]:
s1.str.count('p')

0    0
1    0
2    0
3    2
dtype: int64

### findall(pattern):

 It returns a list of all occurrences of the pattern. As we can see in below, there is a returned list consisting n as it appears only once in the string.

In [66]:
s1.str.findall('h')

0     []
1     []
2     []
3    [h]
dtype: object

### find(pattern):

It returns the first position of the first occurrence of the pattern. We can see in the example below, that it returns the index value of appearance of character â€˜nâ€™ in each string throughout the DataFrame

In [69]:
s1.str.find('p')

0   -1
1   -1
2   -1
3    2
dtype: int64

In [16]:
s1.str.find('h')

0   -1
1   -1
2   -1
3    0
dtype: int64

### startswith():

Pandas startswith() is yet another method to search and filter text data in Series or Data Frame

In [71]:
s1.str.startswith('h')

0    False
1    False
2    False
3     True
dtype: bool

### endswith(pattern):

It returns true if the element or string in the DataFrame Index ends with the pattern.

In [72]:
s1.str.startswith('h')

0    False
1    False
2    False
3     True
dtype: bool

In [7]:
s1.str.endswith('h')

0    False
1    False
2    False
3    False
dtype: bool

### get_dummies():

It returns the DataFrame with One-Hot Encoded values like we can see that it returns boolean value 1 if it exists in relative index or 0 if not exists.

In [76]:
s1.str.get_dummies()

   1  3  happy  t
0  1  0      0  0
1  0  1      0  0
2  0  0      0  1
3  0  0      1  0

In [79]:
s1.str.get_dummies('1')

   3  happy  t
0  0      0  0
1  1      0  0
2  0      0  1
3  0      1  0

In [80]:
s1.str.get_dummies('t')

   1  3  happy
0  1  0      0
1  0  1      0
2  0  0      0
3  0  0      1

### encode():

encode() function to encode the character strings present in the underlying data of the given series object

In [93]:
s1.str.encode('CP500')

0                    b'\xf1'
1                    b'\xf3'
2                    b'\xa3'
3    b'\x88\x81\x97\x97\xa8'
dtype: object

### decode():

str. decode() function is used to decode character string in the Series/Index using indicated encoding

In [95]:
s1.str.decode('CP500')

0   NaN
1   NaN
2   NaN
3   NaN
dtype: float64

### encode and decode

In [100]:
s3=pd.Series(['alicesmith','bobjones','charliejoneson','daisywhite'])
print(s3)
print(s3.str.decode(encoding='UTF8'))

0        alicesmith
1          bobjones
2    charliejoneson
3        daisywhite
dtype: object
0   NaN
1   NaN
2   NaN
3   NaN
dtype: float64

# 7-5-22

## regular expression

split() , count() , match()

we can use
* (r'(^a)')
* (r'(^a*)')
* (r'(^a.*)')
* (r'(^a),*')
* (r'^(f,F)')
* (r'(^f)')
contains
* (r'([/f])')
* (r'(^[f,m,s].*)')
* (r'(^f.*)')
* (r'([a]$.*)')
* (r'([a,d]$.*)')
* (r'([/m].*)')
findall
* (r'(^M)') --->get letter starts with M [M] for mumbai
* (r'(^M.*)') --->[mumbai]
* (r'(^M)*') --->[M,,,,,]
* (r'(^M).*') ----->[][][][][]
split
* (r'(^F)') ----> [,F,inland][,F,lorida]
* (r'(^F.*)') ---->[,Finland,][,Florida,]
* (r'(^F*)') ---->[,F,inland][,F,lorida]
* (r'(^F).*)') ---->[,F,][,F,]

### countains

In [3]:
import pandas as pd
list = ['puerto rico','finland','colombia','florida','japan','portland','india','mumbai','moulali']
ser = pd.Series(list)
print(ser)

0    puerto rico
1        finland
2       colombia
3        florida
4          japan
5       portland
6          india
7         mumbai
8        moulali
dtype: object

In [8]:
ser.str.contains('mbia')

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [23]:
ser.str.contains(r'(^f)')

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [4]:
ser.str.contains(r'(^f)')

C:\Users\91905\anaconda3\lib\site-packages\pandas\core\strings\accessor.py:101: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [1]:
import pandas as pd
import numpy as np
d=['hello','world']
k=pd.Series(d)
print(k)

0    hello
1    world
dtype: object

In [7]:
k.str.contains('rld')

0    False
1     True
dtype: bool

In [12]:
import pandas as pd
list=['gopika','varshini']
a=pd.Series(list)
print(a)

0      gopika
1    varshini
dtype: object

In [13]:
a.str.contains('ini')

0    False
1     True
dtype: bool

### extract

In [8]:
ser.str.extract(r'(^e)')

     0
0  NaN
1  NaN
2  NaN
3  NaN
4  NaN
5  NaN
6  NaN
7  NaN
8  NaN

In [9]:
ser.str.count(r'(^e)')

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
dtype: int64

### count  

Count occurrences of pattern in each string of the Series/Index

In [5]:
import pandas as pd
list = ['puerto rico','finland','colombia','florida','japan','portland','india','mumbai','moulali']
ser = pd.Series(list)
print(ser)
ser.str.count(r'(^e)')

0    puerto rico
1        finland
2       colombia
3        florida
4          japan
5       portland
6          india
7         mumbai
8        moulali
dtype: object

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
dtype: int64

### extract

In [21]:
ser.str.extract(r'(^e)')

     0
0  NaN
1  NaN
2  NaN
3  NaN
4  NaN
5  NaN
6  NaN
7  NaN
8  NaN

In [24]:
ser.str.count(r'(^e)')

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
dtype: int64

In [25]:
ser.str.extract(r'(^e*)')

  0
0
1
2
3
4
5
6
7
8

In [29]:
ser.str.extract(r'(^f.*)')

         0
0      NaN
1  finland
2      NaN
3  florida
4      NaN
5      NaN
6      NaN
7      NaN
8      NaN

In [28]:
ser.str.match(r'(^e)')

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [27]:
ser.str.contains(r'(^f)')

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [29]:
ser.str.extract(r'(^f.*)')

         0
0      NaN
1  finland
2      NaN
3  florida
4      NaN
5      NaN
6      NaN
7      NaN
8      NaN

In [26]:
ser.str.contains(r'($f)')

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [25]:
ser.str.contains(r'^(f,m)')

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [24]:
ser.str.contains(r'(f$)')

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [23]:
ser.str.contains(r'^(f.m)')

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [22]:
ser.str.split(r'(^f.*)')

0    [@uerto rico]
1    [, finland, ]
2       [colombia]
3    [, florida, ]
4          [ja@an]
5       [@ortland]
6          [india]
7         [mumbai]
8        [moulali]
dtype: object

In [21]:
ser.str.match(r'^(f,F)')

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [20]:
ser.str.findall(r'(^M).*')

0    []
1    []
2    []
3    []
4    []
5    []
6    []
7    []
8    []
dtype: object

In [19]:
ser.str.findall(r'(^M)*')

0    [, , , , , , , , , , , ]
1            [, , , , , , , ]
2          [, , , , , , , , ]
3            [, , , , , , , ]
4                [, , , , , ]
5          [, , , , , , , , ]
6                [, , , , , ]
7              [, , , , , , ]
8            [, , , , , , , ]
dtype: object

In [18]:
ser.str.contains(r'([a,d]$.*)')

0    False
1     True
2     True
3     True
4    False
5     True
6     True
7    False
8    False
dtype: bool

In [17]:
ser.str.contains(r'(^[f,m,s].*)')

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7     True
8     True
dtype: bool

In [16]:
ser.str.contains(r'(^f.*)')

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [135]:
import pandas as pd
list = ['puerto rico','finland','colombia','florida','japan','portland','india','mumbai','moulali']
ser = pd.Series(list)
print(ser)
ser.str.contains('r([a]$.*)')

0    puerto rico
1        finland
2       colombia
3        florida
4          japan
5       portland
6          india
7         mumbai
8        moulali
dtype: object

C:\Users\91905\anaconda3\lib\site-packages\pandas\core\strings\accessor.py:101: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [14]:
gopi=ser.replace('p','@',regex=True,inplace=True)
print(gopi)

None

In [13]:
gopi=ser.replace('p','@',regex=True,inplace=False)
print(gopi)

0    @uerto rico
1        finland
2       colombia
3        florida
4          ja@an
5       @ortland
6          india
7         mumbai
8        moulali
dtype: object

In [12]:
gopi=ser.replace('p','@',regex=False,inplace=False)
print(gopi)

0    puerto rico
1        finland
2       colombia
3        florida
4          japan
5       portland
6          india
7         mumbai
8        moulali
dtype: object

In [11]:
ser.str.split(r'(^F)')

0    [puerto rico]
1        [finland]
2       [colombia]
3        [florida]
4          [japan]
5       [portland]
6          [india]
7         [mumbai]
8        [moulali]
dtype: object

In [10]:
ser.str.split(r'(^F.*)')

0    [puerto rico]
1        [finland]
2       [colombia]
3        [florida]
4          [japan]
5       [portland]
6          [india]
7         [mumbai]
8        [moulali]
dtype: object

# 12-5-22

# dataframe

In [14]:
import pandas as pd
data = [['tom', 10], ['nick', 15], ['juli', 14]]
df = pd.DataFrame(data, columns = ['Name', 'Age'])
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [5]:
import pandas as pd
data = [['bob','accounting', 2008],
        ['jake','engineering',2012],
        ['lisa', 'engineering',2014],
        ['sue','hr',2003]]
df1 = pd.DataFrame(data, columns = ['employee', 'group','hiredate'])
df1

  employee        group  hiredate
0      bob   accounting      2008
1     jake  engineering      2012
2     lisa  engineering      2014
3      sue           hr      2003

In [10]:
import pandas as pd
data = [['accounting','carle'],
        ['engineering','guide'],
        ['hr', 'steve']]
df2= pd.DataFrame(data, columns = ['group','superior'])
df2

         group superior
0   accounting    carle
1  engineering    guide
2           hr    steve

In [13]:
import pandas as pd
data = [['accounting','math'],
        ['accounting','spreadsheets'],
        ['engineering', 'coding'],
       ['engineering','linux'],
       ['hr','spreadsheets'],
       ['hr','hr.shells']]
df3= pd.DataFrame(data, columns = ['group','skills'])
df3

         group        skills
0   accounting          math
1   accounting  spreadsheets
2  engineering        coding
3  engineering         linux
4           hr  spreadsheets
5           hr     hr.shells

### merge

here one to one mapping is done

In [20]:
pd.merge(df1,df2)

  employee        group  hiredate superior
0      bob   accounting      2008    carle
1     jake  engineering      2012    guide
2     lisa  engineering      2014    guide
3      sue           hr      2003    steve

In [22]:
pd.merge(df2,df3)

         group superior        skills
0   accounting    carle          math
1   accounting    carle  spreadsheets
2  engineering    guide        coding
3  engineering    guide         linux
4           hr    steve  spreadsheets
5           hr    steve     hr.shells

In [24]:
pd.merge(df1,df3)

  employee        group  hiredate        skills
0      bob   accounting      2008          math
1      bob   accounting      2008  spreadsheets
2     jake  engineering      2012        coding
3     jake  engineering      2012         linux
4     lisa  engineering      2014        coding
5     lisa  engineering      2014         linux
6      sue           hr      2003  spreadsheets
7      sue           hr      2003     hr.shells

### info()

gives info about given data

In [29]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   employee  4 non-null      object
 1   group     4 non-null      object
 2   hiredate  4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [34]:
df2.info

<bound method DataFrame.info of          group superior
0   accounting    carle
1  engineering    guide
2           hr    steve>

In [33]:
df3.info

<bound method DataFrame.info of          group        skills
0   accounting          math
1   accounting  spreadsheets
2  engineering        coding
3  engineering         linux
4           hr  spreadsheets
5           hr     hr.shells>

### join()

we use .join() function this function is used for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [41]:
data=df.join(df1)
data

   Name  Age employee        group  hiredate
0   tom   10      bob   accounting      2008
1  nick   15     jake  engineering      2012
2  juli   14     lisa  engineering      2014

In [44]:
data = df.join(df2)
data

   Name  Age        group superior
0   tom   10   accounting    carle
1  nick   15  engineering    guide
2  juli   14           hr    steve

In [46]:
data= df.join(df3)
data

   Name  Age        group        skills
0   tom   10   accounting          math
1  nick   15   accounting  spreadsheets
2  juli   14  engineering        coding

### join(outer())

In [59]:
data =df.join(df1, how='outer')
data

   Name   Age employee        group  hiredate
0   tom  10.0      bob   accounting      2008
1  nick  15.0     jake  engineering      2012
2  juli  14.0     lisa  engineering      2014
3   NaN   NaN      sue           hr      2003

### merge()

In [73]:
res=pd.merge(df1,df2,on='group')
res

  employee        group  hiredate superior
0      bob   accounting      2008    carle
1     jake  engineering      2012    guide
2     lisa  engineering      2014    guide
3      sue           hr      2003    steve

###  append()

In [65]:
b=df1.append(df1)
print(b)

  employee        group  hiredate
0      bob   accounting      2008
1     jake  engineering      2012
2     lisa  engineering      2014
3      sue           hr      2003
0      bob   accounting      2008
1     jake  engineering      2012
2     lisa  engineering      2014
3      sue           hr      2003

In [81]:
b1=df1.append(df2)
print(b1)

  employee        group  hiredate superior
0      bob   accounting    2008.0      NaN
1     jake  engineering    2012.0      NaN
2     lisa  engineering    2014.0      NaN
3      sue           hr    2003.0      NaN
0      NaN   accounting       NaN    carle
1      NaN  engineering       NaN    guide
2      NaN           hr       NaN    steve

In [80]:
b3=df3.append(df1)
print(b3)

         group        skills employee  hiredate
0   accounting          math      NaN       NaN
1   accounting  spreadsheets      NaN       NaN
2  engineering        coding      NaN       NaN
3  engineering         linux      NaN       NaN
4           hr  spreadsheets      NaN       NaN
5           hr     hr.shells      NaN       NaN
0   accounting           NaN      bob    2008.0
1  engineering           NaN     jake    2012.0
2  engineering           NaN     lisa    2014.0
3           hr           NaN      sue    2003.0

### merge()

In [78]:
a1=pd.merge(df1,df2)
print(a1)

  employee        group  hiredate superior
0      bob   accounting      2008    carle
1     jake  engineering      2012    guide
2     lisa  engineering      2014    guide
3      sue           hr      2003    steve

In [77]:
a2=pd.merge(df1,df2)
print(a2)

  employee        group  hiredate superior
0      bob   accounting      2008    carle
1     jake  engineering      2012    guide
2     lisa  engineering      2014    guide
3      sue           hr      2003    steve

In [76]:
a3=pd.merge(df1,df3)
a3

  employee        group  hiredate        skills
0      bob   accounting      2008          math
1      bob   accounting      2008  spreadsheets
2     jake  engineering      2012        coding
3     jake  engineering      2012         linux
4     lisa  engineering      2014        coding
5     lisa  engineering      2014         linux
6      sue           hr      2003  spreadsheets
7      sue           hr      2003     hr.shells

### left_index and right_index

In [91]:
c1=pd.merge(df1,df2,left_index=True,right_index=True)
c1

  employee      group_x  hiredate      group_y superior
0      bob   accounting      2008   accounting    carle
1     jake  engineering      2012  engineering    guide
2     lisa  engineering      2014           hr    steve

In [117]:
c6=pd.merge(df2,df3,left_index=True,right_index=True)
c6

       group_x superior      group_y        skills
0   accounting    carle   accounting          math
1  engineering    guide   accounting  spreadsheets
2           hr    steve  engineering        coding

In [118]:
c7=pd.merge(df1,df3,left_index=True,right_index=True)
c7

  employee      group_x  hiredate      group_y        skills
0      bob   accounting      2008   accounting          math
1     jake  engineering      2012   accounting  spreadsheets
2     lisa  engineering      2014  engineering        coding
3      sue           hr      2003  engineering         linux

In [123]:
c6=pd.merge(df2,df3,left_index=False,right_index=False)
c6

         group superior        skills
0   accounting    carle          math
1   accounting    carle  spreadsheets
2  engineering    guide        coding
3  engineering    guide         linux
4           hr    steve  spreadsheets
5           hr    steve     hr.shells

### merge(on and how)

In [95]:
c2=pd.merge(df1,df2,on='group',how='inner')
c2

  employee        group  hiredate superior
0      bob   accounting      2008    carle
1     jake  engineering      2012    guide
2     lisa  engineering      2014    guide
3      sue           hr      2003    steve

### merge(inner)

common intersection will be outputed

In [104]:
c3=pd.merge(df1,df2,how='inner')
c3

  employee        group  hiredate superior
0      bob   accounting      2008    carle
1     jake  engineering      2012    guide
2     lisa  engineering      2014    guide
3      sue           hr      2003    steve

### merge(outer)

all will be outputed

In [98]:
c3=pd.merge(df1,df2,how='outer')
c3

  employee        group  hiredate superior
0      bob   accounting      2008    carle
1     jake  engineering      2012    guide
2     lisa  engineering      2014    guide
3      sue           hr      2003    steve

### merge(cross)

In [106]:
c4=pd.merge(df1,df2,how='cross')
c4

   employee      group_x  hiredate      group_y superior
0       bob   accounting      2008   accounting    carle
1       bob   accounting      2008  engineering    guide
2       bob   accounting      2008           hr    steve
3      jake  engineering      2012   accounting    carle
4      jake  engineering      2012  engineering    guide
5      jake  engineering      2012           hr    steve
6      lisa  engineering      2014   accounting    carle
7      lisa  engineering      2014  engineering    guide
8      lisa  engineering      2014           hr    steve
9       sue           hr      2003   accounting    carle
10      sue           hr      2003  engineering    guide
11      sue           hr      2003           hr    steve

In [107]:
c5=pd.merge(df2,df3,how='cross')
c5

        group_x superior      group_y        skills
0    accounting    carle   accounting          math
1    accounting    carle   accounting  spreadsheets
2    accounting    carle  engineering        coding
3    accounting    carle  engineering         linux
4    accounting    carle           hr  spreadsheets
5    accounting    carle           hr     hr.shells
6   engineering    guide   accounting          math
7   engineering    guide   accounting  spreadsheets
8   engineering    guide  engineering        coding
9   engineering    guide  engineering         linux
10  engineering    guide           hr  spreadsheets
11  engineering    guide           hr     hr.shells
12           hr    steve   accounting          math
13           hr    steve   accounting  spreadsheets
14           hr    steve  engineering        coding
15           hr    steve  engineering         linux
16           hr    steve           hr  spreadsheets
17           hr    steve           hr     hr.shells

In [ ]:
sort,copy,right and left index

### sort()

In [109]:
s=pd.merge(df1,df2,sort='True')
print(s)

  employee        group  hiredate superior
0      bob   accounting      2008    carle
1     jake  engineering      2012    guide
2     lisa  engineering      2014    guide
3      sue           hr      2003    steve

In [110]:
s1=pd.merge(df2,df3,sort='True')
print(s1)

         group superior        skills
0   accounting    carle          math
1   accounting    carle  spreadsheets
2  engineering    guide        coding
3  engineering    guide         linux
4           hr    steve  spreadsheets
5           hr    steve     hr.shells

In [113]:
s2=pd.merge(df1,df2,sort='False')
print(s2)

  employee        group  hiredate superior
0      bob   accounting      2008    carle
1     jake  engineering      2012    guide
2     lisa  engineering      2014    guide
3      sue           hr      2003    steve

### merge(copy)

In [129]:
s3=pd.merge(df1,df2,copy='True')
s3

  employee        group  hiredate superior
0      bob   accounting      2008    carle
1     jake  engineering      2012    guide
2     lisa  engineering      2014    guide
3      sue           hr      2003    steve

In [130]:
s4=pd.merge(df3,df2,copy='False')
s4

         group        skills superior
0   accounting          math    carle
1   accounting  spreadsheets    carle
2  engineering        coding    guide
3  engineering         linux    guide
4           hr  spreadsheets    steve
5           hr     hr.shells    steve

In [131]:
s5=pd.merge(df2,df1,copy='True')
s5

         group superior employee  hiredate
0   accounting    carle      bob      2008
1  engineering    guide     jake      2012
2  engineering    guide     lisa      2014
3           hr    steve      sue      2003

# 28-05-22

### frequencies

these are composed of a base frequencies

In [2]:
import pandas as pd
pd.date_range('2000-01-01','2000-01-03 23:59',freq='4h')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4H')

In [3]:
pd.date_range('2000-01-01',periods=10,freq='6h30min')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 06:30:00',
               '2000-01-01 13:00:00', '2000-01-01 19:30:00',
               '2000-01-02 02:00:00', '2000-01-02 08:30:00',
               '2000-01-02 15:00:00', '2000-01-02 21:30:00',
               '2000-01-03 04:00:00', '2000-01-03 10:30:00'],
              dtype='datetime64[ns]', freq='390T')

In [7]:
rng=pd.date_range('2012-01-01','2012-09-01',freq='WOM-3SAT')        #wom-week of month
list(rng)

[Timestamp('2012-01-21 00:00:00', freq='WOM-3SAT'),
 Timestamp('2012-02-18 00:00:00', freq='WOM-3SAT'),
 Timestamp('2012-03-17 00:00:00', freq='WOM-3SAT'),
 Timestamp('2012-04-21 00:00:00', freq='WOM-3SAT'),
 Timestamp('2012-05-19 00:00:00', freq='WOM-3SAT'),
 Timestamp('2012-06-16 00:00:00', freq='WOM-3SAT'),
 Timestamp('2012-07-21 00:00:00', freq='WOM-3SAT'),
 Timestamp('2012-08-18 00:00:00', freq='WOM-3SAT')]

###shifting of data

moving data forward and backword

In [9]:
import numpy as np
import pandas as pd
ts=pd.Series(np.random.randn(4),index=pd.date_range('1/1/2000',periods=4,freq='M'))
print(ts)
print(ts.shift(2))
print(ts.shift(-2))

2000-01-31   -0.792479
2000-02-29   -1.049472
2000-03-31   -0.007936
2000-04-30   -0.926207
Freq: M, dtype: float64
2000-01-31         NaN
2000-02-29         NaN
2000-03-31   -0.792479
2000-04-30   -1.049472
Freq: M, dtype: float64
2000-01-31   -0.007936
2000-02-29   -0.926207
2000-03-31         NaN
2000-04-30         NaN
Freq: M, dtype: float64

In [10]:
ts.shift(2,freq='M')

2000-03-31   -0.792479
2000-04-30   -1.049472
2000-05-31   -0.007936
2000-06-30   -0.926207
Freq: M, dtype: float64

In [11]:
ts

2000-01-31   -0.792479
2000-02-29   -1.049472
2000-03-31   -0.007936
2000-04-30   -0.926207
Freq: M, dtype: float64

In [12]:
ts.shift(2,freq='D')

2000-02-02   -0.792479
2000-03-02   -1.049472
2000-04-02   -0.007936
2000-05-02   -0.926207
dtype: float64

In [13]:
ts.shift(3,freq='D')

2000-02-03   -0.792479
2000-03-03   -1.049472
2000-04-03   -0.007936
2000-05-03   -0.926207
dtype: float64

In [14]:
ts.shift(3,freq='M')

2000-04-30   -0.792479
2000-05-31   -1.049472
2000-06-30   -0.007936
2000-07-31   -0.926207
Freq: M, dtype: float64

In [15]:
ts.shift(1,freq='120T')

2000-01-31 02:00:00   -0.792479
2000-02-29 02:00:00   -1.049472
2000-03-31 02:00:00   -0.007936
2000-04-30 02:00:00   -0.926207
dtype: float64

### Time zone handeling

working with time zones is generally considered one of the most unpleasent parts of time series manipulation.
we need to include "pytz" library

In [16]:
import pandas as pd
import pytz
pytz.common_timezones

['Africa/Abidjan', 'Africa/Accra', 'Africa/Addis_Ababa', 'Africa/Algiers', 'Africa/Asmara', 'Africa/Bamako', 'Africa/Bangui', 'Africa/Banjul', 'Africa/Bissau', 'Africa/Blantyre', 'Africa/Brazzaville', 'Africa/Bujumbura', 'Africa/Cairo', 'Africa/Casablanca', 'Africa/Ceuta', 'Africa/Conakry', 'Africa/Dakar', 'Africa/Dar_es_Salaam', 'Africa/Djibouti', 'Africa/Douala', 'Africa/El_Aaiun', 'Africa/Freetown', 'Africa/Gaborone', 'Africa/Harare', 'Africa/Johannesburg', 'Africa/Juba', 'Africa/Kampala', 'Africa/Khartoum', 'Africa/Kigali', 'Africa/Kinshasa', 'Africa/Lagos', 'Africa/Libreville', 'Africa/Lome', 'Africa/Luanda', 'Africa/Lubumbashi', 'Africa/Lusaka', 'Africa/Malabo', 'Africa/Maputo', 'Africa/Maseru', 'Africa/Mbabane', 'Africa/Mogadishu', 'Africa/Monrovia', 'Africa/Nairobi', 'Africa/Ndjamena', 'Africa/Niamey', 'Africa/Nouakchott', 'Africa/Ouagadougou', 'Africa/Porto-Novo', 'Africa/Sao_Tome', 'Africa/Tripoli', 'Africa/Tunis', 'Africa/Windhoek', 'America/Adak', 'America/Anchorage', 'America/Anguilla', 'America/Antigua', 'America/Araguaina', 'America/Argentina/Buenos_Aires', 'America/Argentina/Catamarca', 'America/Argentina/Cordoba', 'America/Argentina/Jujuy', 'America/Argentina/La_Rioja', 'America/Argentina/Mendoza', 'America/Argentina/Rio_Gallegos', 'America/Argentina/Salta', 'America/Argentina/San_Juan', 'America/Argentina/San_Luis', 'America/Argentina/Tucuman', 'America/Argentina/Ushuaia', 'America/Aruba', 'America/Asuncion', 'America/Atikokan', 'America/Bahia', 'America/Bahia_Banderas', 'America/Barbados', 'America/Belem', 'America/Belize', 'America/Blanc-Sablon', 'America/Boa_Vista', 'America/Bogota', 'America/Boise', 'America/Cambridge_Bay', 'America/Campo_Grande', 'America/Cancun', 'America/Caracas', 'America/Cayenne', 'America/Cayman', 'America/Chicago', 'America/Chihuahua', 'America/Costa_Rica', 'America/Creston', 'America/Cuiaba', 'America/Curacao', 'America/Danmarkshavn', 'America/Dawson', 'America/Dawson_Creek', 'America/Denver', 'America/Detroit', 'America/Dominica', 'America/Edmonton', 'America/Eirunepe', 'America/El_Salvador', 'America/Fort_Nelson', 'America/Fortaleza', 'America/Glace_Bay', 'America/Goose_Bay', 'America/Grand_Turk', 'America/Grenada', 'America/Guadeloupe', 'America/Guatemala', 'America/Guayaquil', 'America/Guyana', 'America/Halifax', 'America/Havana', 'America/Hermosillo', 'America/Indiana/Indianapolis', 'America/Indiana/Knox', 'America/Indiana/Marengo', 'America/Indiana/Petersburg', 'America/Indiana/Tell_City', 'America/Indiana/Vevay', 'America/Indiana/Vincennes', 'America/Indiana/Winamac', 'America/Inuvik', 'America/Iqaluit', 'America/Jamaica', 'America/Juneau', 'America/Kentucky/Louisville', 'America/Kentucky/Monticello', 'America/Kralendijk', 'America/La_Paz', 'America/Lima', 'America/Los_Angeles', 'America/Lower_Princes', 'America/Maceio', 'America/Managua', 'America/Manaus', 'America/Marigot', 'America/Martinique', 'America/Matamoros', 'America/Mazatlan', 'America/Menominee', 'America/Merida', 'America/Metlakatla', 'America/Mexico_City', 'America/Miquelon', 'America/Moncton', 'America/Monterrey', 'America/Montevideo', 'America/Montserrat', 'America/Nassau', 'America/New_York', 'America/Nipigon', 'America/Nome', 'America/Noronha', 'America/North_Dakota/Beulah', 'America/North_Dakota/Center', 'America/North_Dakota/New_Salem', 'America/Nuuk', 'America/Ojinaga', 'America/Panama', 'America/Pangnirtung', 'America/Paramaribo', 'America/Phoenix', 'America/Port-au-Prince', 'America/Port_of_Spain', 'America/Porto_Velho', 'America/Puerto_Rico', 'America/Punta_Arenas', 'America/Rainy_River', 'America/Rankin_Inlet', 'America/Recife', 'America/Regina', 'America/Resolute', 'America/Rio_Branco', 'America/Santarem', 'America/Santiago', 'America/Santo_Domingo', 'America/Sao_Paulo', 'America/Scoresbysund', 'America/Sitka', 'America/St_Barthelemy', 'America/St_Johns', 'America/St_Kitts', 'America/St_Lucia', 'America/St_Thomas', 'America/St_Vincent', 'America/Swift_Current', 'America/Tegucigalpa', 'America/Thule', 'America/Thunder_Bay', 'America/Tijuana', 'America/Toronto', 'America/Tortola', 'America/Vancouver', 'America/Whitehorse', 'America/Winnipeg', 'America/Yakutat', 'America/Yellowknife', 'Antarctica/Casey', 'Antarctica/Davis', 'Antarctica/DumontDUrville', 'Antarctica/Macquarie', 'Antarctica/Mawson', 'Antarctica/McMurdo', 'Antarctica/Palmer', 'Antarctica/Rothera', 'Antarctica/Syowa', 'Antarctica/Troll', 'Antarctica/Vostok', 'Arctic/Longyearbyen', 'Asia/Aden', 'Asia/Almaty', 'Asia/Amman', 'Asia/Anadyr', 'Asia/Aqtau', 'Asia/Aqtobe', 'Asia/Ashgabat', 'Asia/Atyrau', 'Asia/Baghdad', 'Asia/Bahrain', 'Asia/Baku', 'Asia/Bangkok', 'Asia/Barnaul', 'Asia/Beirut', 'Asia/Bishkek', 'Asia/Brunei', 'Asia/Chita', 'Asia/Choibalsan', 'Asia/Colombo', 'Asia/Damascus', 'Asia/Dhaka', 'Asia/Dili', 'Asia/Dubai', 'Asia/Dushanbe', 'Asia/Famagusta', 'Asia/Gaza', 'Asia/Hebron', 'Asia/Ho_Chi_Minh', 'Asia/Hong_Kong', 'Asia/Hovd', 'Asia/Irkutsk', 'Asia/Jakarta', 'Asia/Jayapura', 'Asia/Jerusalem', 'Asia/Kabul', 'Asia/Kamchatka', 'Asia/Karachi', 'Asia/Kathmandu', 'Asia/Khandyga', 'Asia/Kolkata', 'Asia/Krasnoyarsk', 'Asia/Kuala_Lumpur', 'Asia/Kuching', 'Asia/Kuwait', 'Asia/Macau', 'Asia/Magadan', 'Asia/Makassar', 'Asia/Manila', 'Asia/Muscat', 'Asia/Nicosia', 'Asia/Novokuznetsk', 'Asia/Novosibirsk', 'Asia/Omsk', 'Asia/Oral', 'Asia/Phnom_Penh', 'Asia/Pontianak', 'Asia/Pyongyang', 'Asia/Qatar', 'Asia/Qostanay', 'Asia/Qyzylorda', 'Asia/Riyadh', 'Asia/Sakhalin', 'Asia/Samarkand', 'Asia/Seoul', 'Asia/Shanghai', 'Asia/Singapore', 'Asia/Srednekolymsk', 'Asia/Taipei', 'Asia/Tashkent', 'Asia/Tbilisi', 'Asia/Tehran', 'Asia/Thimphu', 'Asia/Tokyo', 'Asia/Tomsk', 'Asia/Ulaanbaatar', 'Asia/Urumqi', 'Asia/Ust-Nera', 'Asia/Vientiane', 'Asia/Vladivostok', 'Asia/Yakutsk', 'Asia/Yangon', 'Asia/Yekaterinburg', 'Asia/Yerevan', 'Atlantic/Azores', 'Atlantic/Bermuda', 'Atlantic/Canary', 'Atlantic/Cape_Verde', 'Atlantic/Faroe', 'Atlantic/Madeira', 'Atlantic/Reykjavik', 'Atlantic/South_Georgia', 'Atlantic/St_Helena', 'Atlantic/Stanley', 'Australia/Adelaide', 'Australia/Brisbane', 'Australia/Broken_Hill', 'Australia/Darwin', 'Australia/Eucla', 'Australia/Hobart', 'Australia/Lindeman', 'Australia/Lord_Howe', 'Australia/Melbourne', 'Australia/Perth', 'Australia/Sydney', 'Canada/Atlantic', 'Canada/Central', 'Canada/Eastern', 'Canada/Mountain', 'Canada/Newfoundland', 'Canada/Pacific', 'Europe/Amsterdam', 'Europe/Andorra', 'Europe/Astrakhan', 'Europe/Athens', 'Europe/Belgrade', 'Europe/Berlin', 'Europe/Bratislava', 'Europe/Brussels', 'Europe/Bucharest', 'Europe/Budapest', 'Europe/Busingen', 'Europe/Chisinau', 'Europe/Copenhagen', 'Europe/Dublin', 'Europe/Gibraltar', 'Europe/Guernsey', 'Europe/Helsinki', 'Europe/Isle_of_Man', 'Europe/Istanbul', 'Europe/Jersey', 'Europe/Kaliningrad', 'Europe/Kiev', 'Europe/Kirov', 'Europe/Lisbon', 'Europe/Ljubljana', 'Europe/London', 'Europe/Luxembourg', 'Europe/Madrid', 'Europe/Malta', 'Europe/Mariehamn', 'Europe/Minsk', 'Europe/Monaco', 'Europe/Moscow', 'Europe/Oslo', 'Europe/Paris', 'Europe/Podgorica', 'Europe/Prague', 'Europe/Riga', 'Europe/Rome', 'Europe/Samara', 'Europe/San_Marino', 'Europe/Sarajevo', 'Europe/Saratov', 'Europe/Simferopol', 'Europe/Skopje', 'Europe/Sofia', 'Europe/Stockholm', 'Europe/Tallinn', 'Europe/Tirane', 'Europe/Ulyanovsk', 'Europe/Uzhgorod', 'Europe/Vaduz', 'Europe/Vatican', 'Europe/Vienna', 'Europe/Vilnius', 'Europe/Volgograd', 'Europe/Warsaw', 'Europe/Zagreb', 'Europe/Zaporozhye', 'Europe/Zurich', 'GMT', 'Indian/Antananarivo', 'Indian/Chagos', 'Indian/Christmas', 'Indian/Cocos', 'Indian/Comoro', 'Indian/Kerguelen', 'Indian/Mahe', 'Indian/Maldives', 'Indian/Mauritius', 'Indian/Mayotte', 'Indian/Reunion', 'Pacific/Apia', 'Pacific/Auckland', 'Pacific/Bougainville', 'Pacific/Chatham', 'Pacific/Chuuk', 'Pacific/Easter', 'Pacific/Efate', 'Pacific/Enderbury', 'Pacific/Fakaofo', 'Pacific/Fiji', 'Pacific/Funafuti', 'Pacific/Galapagos', 'Pacific/Gambier', 'Pacific/Guadalcanal', 'Pacific/Guam', 'Pacific/Honolulu', 'Pacific/Kiritimati', 'Pacific/Kosrae', 'Pacific/Kwajalein', 'Pacific/Majuro', 'Pacific/Marquesas', 'Pacific/Midway', 'Pacific/Nauru', 'Pacific/Niue', 'Pacific/Norfolk', 'Pacific/Noumea', 'Pacific/Pago_Pago', 'Pacific/Palau', 'Pacific/Pitcairn', 'Pacific/Pohnpei', 'Pacific/Port_Moresby', 'Pacific/Rarotonga', 'Pacific/Saipan', 'Pacific/Tahiti', 'Pacific/Tarawa', 'Pacific/Tongatapu', 'Pacific/Wake', 'Pacific/Wallis', 'US/Alaska', 'US/Arizona', 'US/Central', 'US/Eastern', 'US/Hawaii', 'US/Mountain', 'US/Pacific', 'UTC']

In [19]:
tz=pytz.timezone('Asia/Kolkata')
tz

In [21]:
rng=pd.date_range('3/9/2022 9:30',periods=6,freq='D')
ts=pd.Series(np.random.randn(len(rng)),index=rng)
ts

2022-03-09 09:30:00   -0.821032
2022-03-10 09:30:00    0.011226
2022-03-11 09:30:00   -1.568689
2022-03-12 09:30:00   -0.256715
2022-03-13 09:30:00    0.384555
2022-03-14 09:30:00    0.818361
Freq: D, dtype: float64

In [22]:
print(ts.index.tz)

None

In [23]:
pd.date_range('3/9/2012 9:30',periods=10,freq='D',tz='Asia/Kolkata')

DatetimeIndex(['2012-03-09 09:30:00+05:30', '2012-03-10 09:30:00+05:30',
               '2012-03-11 09:30:00+05:30', '2012-03-12 09:30:00+05:30',
               '2012-03-13 09:30:00+05:30', '2012-03-14 09:30:00+05:30',
               '2012-03-15 09:30:00+05:30', '2012-03-16 09:30:00+05:30',
               '2012-03-17 09:30:00+05:30', '2012-03-18 09:30:00+05:30'],
              dtype='datetime64[ns, Asia/Kolkata]', freq='D')

In [25]:
print(ts)
ts_utc=ts.tz_localize("UTC")
ts_utc
ts_utc.index

2022-03-09 09:30:00   -0.821032
2022-03-10 09:30:00    0.011226
2022-03-11 09:30:00   -1.568689
2022-03-12 09:30:00   -0.256715
2022-03-13 09:30:00    0.384555
2022-03-14 09:30:00    0.818361
Freq: D, dtype: float64

DatetimeIndex(['2022-03-09 09:30:00+00:00', '2022-03-10 09:30:00+00:00',
               '2022-03-11 09:30:00+00:00', '2022-03-12 09:30:00+00:00',
               '2022-03-13 09:30:00+00:00', '2022-03-14 09:30:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='D')

In [26]:
ts_utc.tz_convert('America/New_York')

2022-03-09 04:30:00-05:00   -0.821032
2022-03-10 04:30:00-05:00    0.011226
2022-03-11 04:30:00-05:00   -1.568689
2022-03-12 04:30:00-05:00   -0.256715
2022-03-13 05:30:00-04:00    0.384555
2022-03-14 05:30:00-04:00    0.818361
Freq: D, dtype: float64

In [29]:
ts_eastern=ts.tz_localize('America/New_York')
ts_eastern=ts.tz_convert('UTC')
ts_eastern.tz_convert('Europe/Berlin')

TypeError: Cannot convert tz-naive timestamps, use tz_localize to localize

In [28]:
stamp=pd.Timestamp('2011-03-12 04:00')
stamp_utc=stamp.tz_localize('utc')
print(stamp_utc)
stamp_utc.tz_convert('America/New_York')

2011-03-12 04:00:00+00:00

Timestamp('2011-03-11 23:00:00-0500', tz='America/New_York')

In [30]:
stamp_utc.tz_convert('Asia/Kolkata')

Timestamp('2011-03-12 09:30:00+0530', tz='Asia/Kolkata')

In [31]:
a=pd.Timestamp('2011-03-12 04:00',tz='Europe/Moscow')
a

Timestamp('2011-03-12 04:00:00+0300', tz='Europe/Moscow')

In [32]:
rng=pd.date_range('3/7/2012 9:30',periods=10,freq='B')
rng

DatetimeIndex(['2012-03-07 09:30:00', '2012-03-08 09:30:00',
               '2012-03-09 09:30:00', '2012-03-12 09:30:00',
               '2012-03-13 09:30:00', '2012-03-14 09:30:00',
               '2012-03-15 09:30:00', '2012-03-16 09:30:00',
               '2012-03-19 09:30:00', '2012-03-20 09:30:00'],
              dtype='datetime64[ns]', freq='B')

In [33]:
p=pd.Period(2007,freq='A-DEC')
p

Period('2007', 'A-DEC')

In [34]:
print(p-5)
p-2

2002

Period('2005', 'A-DEC')

In [35]:
rng=pd.period_range('2000-01-01','2000-06-03',freq='M')
rng

PeriodIndex(['2000-01', '2000-02', '2000-03', '2000-04', '2000-05', '2000-06'], dtype='period[M]', freq='M')

In [37]:
p=pd.Period('2007',freq='A-JUN')
print(p)
print(p.asfreq('M','start'))
print(p.asfreq('M','end'))

2007
2006-07
2007-06

### resampling and frequency conversoion

### dowmsampling , upsampling